tap "homebrew/bundle"
tap "ngrok/ngrok"

# Core
brew "bash"
brew "coreutils"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "libpq"
brew "thefuck"
brew "tree"
brew "zsh"

# Databases
brew "postgresql@15"

# Cloud
brew "awscli"
brew "azure-cli"
brew "terraform"

# Languages
brew "node"
brew "python"
brew "go"
## Dotnet SDK
tap "isen-ng/dotnet-sdk-versions"
cask "dotnet-sdk9-0-100"
cask "dotnet-sdk8-0-100"
cask "dotnet-sdk7-0-400"
cask "dotnet-sdk6-0-400"

# Kubernetes
brew "helm"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "minikube"

# Other
brew "aichat"
brew "ansible"

# Casks
cask "discord"
cask "docker"
cask "firefox"
cask "iterm2"
cask "ngrok"
cask "notion"
cask "postman"
cask "raycast"

# VSCode
cask "visual-studio-code"
vscode "4ops.terraform"
vscode "alefragnani.bookmarks"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "csharpier.csharpier-vscode"
vscode "cweijan.vscode-postgresql-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "ionutvmi.path-autocomplete"
vscode "jock.svg"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "pkief.material-icon-theme"
vscode "prateekmahendrakar.prettyxml"
vscode "redhat.vscode-yaml"
vscode "redlin.remove-tabs-on-save"
vscode "rvest.vs-code-prettier-eslint"
vscode "shardulm94.trailing-spaces"
vscode "simonsiefke.svg-preview"
vscode "stylelint.vscode-stylelint"
vscode "tomrijndorp.find-it-faster"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodeshift.mui-snippets"
vscode "waderyan.gitblame"
vscode "zeshuaro.vscode-python-poetry"
