cask "slack"
cask "notion"

brew "zsh"
brew "ansible"
brew "awscli"
brew "aztfexport"
brew "azure-cli"
brew "bash"
brew "coreutils"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "go"
brew "helm"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "libpq"
brew "minikube"
brew "neovim"
brew "node"
brew "python-yq"
brew "python"
brew "sqlite"
brew "swagger-codegen"
brew "terraform"
brew "thefuck"
brew "tree-sitter"
brew "vim"

#==> Casks
cask "azure-data-studio"
cask "devutils"
cask "docker"
cask "microsoft-azure-storage-explorer"
cask "visual-studio-code"
cask "warp"
cask "brave-browser"
cask "raycast"

# dotnet different versions
tap "isen-ng/dotnet-sdk-versions"
cask "dotnet-sdk8-0-100"
cask "dotnet-sdk7-0-400"
cask "dotnet-sdk6-0-400"
