tap 'derailed/k9s'
tap 'homebrew/bundle'
tap 'ngrok/ngrok'
tap 'hashicorp/tap'

brew 'cryptography'
brew 'python@3.13'
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnutls'
brew 'grep'
brew 'helm'
brew 'jq'
brew 'k9s'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'lazygit'
brew 'libpq'
brew 'tree-sitter'
brew 'node', link: false
brew 'pgvector'
brew 'pipx'
brew 'podman'
brew 'podman-compose'
# Object-relational database system
brew 'postgresql'
# Command-line toolkit for Salesforce development
brew 'sf'
# SOcket CAT: netcat on steroids
brew 'socat'
# Tool to build, change, and version infrastructure
brew 'hashicorp/tap/terraform'
# Display directories as trees (with optional color/HTML output)
brew 'tree'
# Vi 'workalike' with many additional features
brew 'vim'
# UNIX shell (command interpreter)
brew 'zsh'
# All-in-one toolbox for developers
cask 'devutils'
# Voice and text chat software
cask 'discord'
# Developer platform
cask 'dotnet-sdk'
# Reverse proxy, secure introspectable tunnels to localhost
cask 'ngrok'
# App to write, plan, collaborate, and get organised
cask 'notion'
cask 'visual-studio-code'
cask 'claude-code'

brew 'nvm'
cask 'spotify', args: { require_sha: false } # Propietary music streaming
